Revit 2027 API
Form.IsInXRayMode Property
Get/set if the form is in X-Ray mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInXRayMode { get; set; }
Public Property IsInXRayMode As Boolean
	Get
	Set
public:
property bool IsInXRayMode {
	bool get ();
	void set (bool value);
}
member IsInXRayMode : bool with get, set
Property Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace